design-test-implementation.org
#+TITLE: Multiplication Tables of Prime Numbers
#+AUTHOR: Yu Shen
#+EMAIL: yubrshen@gmail.com
#+LANGUAGE: en
#+STARTUP: align overview indent fold nodlcheck hidestars oddeven lognotestate
#+PROPERTY: mkdirp yes

* Introduction

This is the file of literate programming for the program of displaying multiplication table of first n primes. 

All artifacts required for making the program are deliberated, designed, developed, and documented in this file. 
Those required artifacts can be generated from this file. 

This file is also the design notes, and design documentation for the program. 
It can be converted to HTML through emacs org-mode, better readability.

For more detailed information about how this literate programming with org-mode/emacs works, please see the Appendix below. 

To compile the program, please read README section below, or read the generated said file. 

* Requirements

The following are the requirements:

Write a program that prints out a multiplication table of the first 10 prime
numbers.

The program must run from the command line and print one table to
STDOUT.

The first row and column of the table should have the 10 primes, with
each cell containing the product of the primes for the corresponding row and
column.

Notes

• Consider complexity. How fast does your code run? How does it scale?

• Consider cases where we want N primes.

• Do not use the Prime class from stdlib (write your own code).

• Write tests. Try to demonstrate TDD/BDD.

Below are the analysis of the requirements. 

** The user-story

Use Case: Basic

A user retrieves multiplication table of the first n prime numbers. 
- The user uses command line to retrieve
- The results should be displayed in STDOUT

- The number of the first prime numbers are 10

- The format should be a table with the first row and column of the table should have the 10 primes, with
each cell containing the product of the primes for the corresponding row and
column.

The columns should be aligned, and right justified. 

Use Case: Extended

Users might want to have multiplications of arbitrary number of prime numbers, 
while keeping the other modality of the use case as the same as the basic one, 
or as much as possible, when the usability and computation feasibility permit. 
 
User might want to have the multiplication table displayed on web page. 

** Non-user-visible requirements
1. Performance: 

The program should provide feedback soon enough to user to avoid the user's feeling doubt whether the program is working correctly. 

2. Scalability:

The response of the program should be still acceptable when the number of prime numbers increase. 
Or some interactive measure should be taken to update the user that progress are being properly made.  

* Architecture

The program can have the following parts:
- User interface providing the command line interface, displaying the outcome of the program, including, optionally, parsing the parameter of the number of prime numbers.
- Computation of prime numbers, their multiplications, proper format, and values for UI to displayed.

With the separation of computation from UI, it would be possible in the future to have different UI, such as web interface, or mobile interface. 
While the computation that is only related to the mathematical model would remain. 

* Design

** Top level entry function: -main

For the user interface, the function -main will implement the command

- It will drive computation to get the calculation results. 
- It will also call functions to format the results and do the side effect of displaying the results.

** Functions for computation

For the computation, there will be the following functions:

(primes n) 

produces the first n primes starting from the smallest, 2. It returns a lazy sequence to be efficient, and responsive. 
Care has been taken to reduce computation as much as possible. 

(multi n numbers) 

produces the multiplications of the first n numbers in numbers which may be a lazy-sequence, 
returns a map with key matrix and value of the computed multiplication table, in terms of sequence of sequences, as sequence of rows
and a key of max, with the maximum value in the matrix. 
The maximum value may be used to for the width of numbers for properly formatting the multiplication table. 
It also returns key of column-row, with value for the header for the columns, and row-header, with value for each row in the table. 

In order to reduce repeated computation of multiplications, a function to perform multiplication is transformed with memoize, in order to cache computation results.

** Functions for representation

For display on STDOUT, the following functions are designed. 

(table-str matrix-map) 

generates the formated string to be displayed for the matrix, based on the output of multi. 
It adds the column header, and row header, makes sure the columns are right-justified. 
 
** Overall integration

(multi-tab-primes n) 

Returns the string suitable to be displayed 
    for the multiplication table of the first n primes. 
    This is the highest level function with side effect. It can be called in main to display the multiplication table. 

