design-test-implementation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Multiplication Tables of Prime Numbers</title>
<!-- 2015-07-02 Thu 08:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yu Shen" />


</head>
<body>
<div id="content">
<h1 class="title">Multiplication Tables of Prime Numbers</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Requirements</a>
<ul>
<li><a href="#sec-2-1">2.1. The user-story</a></li>
<li><a href="#sec-2-2">2.2. Non-user-visible requirements</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Architecture</a></li>
<li><a href="#sec-4">4. Design</a>
<ul>
<li><a href="#sec-4-1">4.1. Top level entry function: -main</a></li>
<li><a href="#sec-4-2">4.2. Functions for computation</a></li>
<li><a href="#sec-4-3">4.3. Functions for representation</a></li>
<li><a href="#sec-4-4">4.4. Overall integration</a></li>
<li><a href="#sec-4-5">4.5. Test Driven Development (TDD)</a></li>
<li><a href="#sec-4-6">4.6. Further Improvement and Extension</a></li>
<li><a href="#sec-4-7">4.7. Algorithm of finding prime numbers</a></li>
<li><a href="#sec-4-8">4.8. Performance optimization for function primse, and others</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Project meta</a>
<ul>
<li><a href="#sec-5-1">5.1. Project definition</a></li>
<li><a href="#sec-5-2">5.2. The README</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Source-code</a>
<ul>
<li><a href="#sec-6-1">6.1. Preamble</a></li>
<li><a href="#sec-6-2">6.2. primes</a></li>
<li><a href="#sec-6-3">6.3. multi</a></li>
<li><a href="#sec-6-4">6.4. table-str</a></li>
<li><a href="#sec-6-5">6.5. multi-tab-primes</a></li>
<li><a href="#sec-6-6">6.6. main</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Appendix</a>
<ul>
<li><a href="#sec-7-1">7.1. Meta: this file, Clojure + Org → LP, etc.</a>
<ul>
<li><a href="#sec-7-1-1">7.1.1. The <b>benefits</b> of LP using Emacs + Org</a></li>
</ul>
</li>
<li><a href="#sec-7-2">7.2. Using this file</a>
<ul>
<li><a href="#sec-7-2-1">7.2.1. Prerequisites</a></li>
<li><a href="#sec-7-2-2">7.2.2. Weaving and tangling</a></li>
<li><a href="#sec-7-2-3">7.2.3. Other coolness</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the file of literate programming for the program of displaying multiplication table of first n primes. 
</p>

<p>
All artifacts required for making the program are deliberated, designed, developed, and documented in this file. 
Those required artifacts can be generated from this file. 
</p>

<p>
This file is also the design notes, and design documentation for the program. 
It can be converted to HTML through emacs org-mode, better readability.
</p>

<p>
For more detailed information about how this literate programming with org-mode/emacs works, please see the Appendix below. 
</p>

<p>
To compile the program, please read README section below, or read the generated said file. 
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">
<p>
The following are the requirements:
</p>

<p>
Write a program that prints out a multiplication table of the first 10 prime
numbers.
</p>

<p>
The program must run from the command line and print one table to
STDOUT.
</p>

<p>
The first row and column of the table should have the 10 primes, with
each cell containing the product of the primes for the corresponding row and
column.
</p>

<p>
Notes
</p>

<p>
• Consider complexity. How fast does your code run? How does it scale?
</p>

<p>
• Consider cases where we want N primes.
</p>

<p>
• Do not use the Prime class from stdlib (write your own code).
</p>

<p>
• Write tests. Try to demonstrate TDD/BDD.
</p>

<p>
Below are the analysis of the requirements. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The user-story</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Use Case: Basic
</p>

<p>
A user retrieves multiplication table of the first n prime numbers. 
</p>
<ul class="org-ul">
<li>The user uses command line to retrieve
</li>
<li>The results should be displayed in STDOUT
</li>

<li>The number of the first prime numbers are 10
</li>

<li>The format should be a table with the first row and column of the table should have the 10 primes, with
</li>
</ul>
<p>
each cell containing the product of the primes for the corresponding row and
column.
</p>

<p>
The columns should be aligned, and right justified. 
</p>

<p>
Use Case: Extended
</p>

<p>
Users might want to have multiplications of arbitrary number of prime numbers, 
while keeping the other modality of the use case as the same as the basic one, 
or as much as possible, when the usability and computation feasibility permit. 
</p>

<p>
User might want to have the multiplication table displayed on web page. 
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Non-user-visible requirements</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Performance: 
</li>
</ol>

<p>
The program should provide feedback soon enough to user to avoid the user's feeling doubt whether the program is working correctly. 
</p>

<ol class="org-ol">
<li>Scalability:
</li>
</ol>

<p>
The response of the program should be still acceptable when the number of prime numbers increase. 
Or some interactive measure should be taken to update the user that progress are being properly made.  
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Architecture</h2>
<div class="outline-text-2" id="text-3">
<p>
The program can have the following parts:
</p>
<ul class="org-ul">
<li>User interface providing the command line interface, displaying the outcome of the program, including, optionally, parsing the parameter of the number of prime numbers.
</li>
<li>Computation of prime numbers, their multiplications, proper format, and values for UI to displayed.
</li>
</ul>

<p>
With the separation of computation from UI, it would be possible in the future to have different UI, such as web interface, or mobile interface. 
While the computation that is only related to the mathematical model would remain. 
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Design</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Top level entry function: -main</h3>
<div class="outline-text-3" id="text-4-1">
<p>
For the user interface, the function -main will implement the command
</p>

<ul class="org-ul">
<li>It will drive computation to get the calculation results. 
</li>
<li>It will also call functions to format the results and do the side effect of displaying the results.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Functions for computation</h3>
<div class="outline-text-3" id="text-4-2">
<p>
For the computation, there will be the following functions:
</p>

<p>
(primes n) 
</p>

<p>
produces the first n primes starting from the smallest, 2. It returns a lazy sequence to be efficient, and responsive. 
Care has been taken to reduce computation as much as possible. 
</p>

<p>
(multi n numbers) 
</p>

<p>
produces the multiplications of the first n numbers in numbers which may be a lazy-sequence, 
returns a map with key matrix and value of the computed multiplication table, in terms of sequence of sequences, as sequence of rows
and a key of max, with the maximum value in the matrix. 
The maximum value may be used to for the width of numbers for properly formatting the multiplication table. 
It also returns key of column-row, with value for the header for the columns, and row-header, with value for each row in the table. 
</p>

<p>
In order to reduce repeated computation of multiplications, a function to perform multiplication is transformed with memoize, in order to cache computation results.
</p>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Functions for representation</h3>
<div class="outline-text-3" id="text-4-3">
<p>
For display on STDOUT, the following functions are designed. 
</p>

<p>
(table-str matrix-map) 
</p>

<p>
generates the formated string to be displayed for the matrix, based on the output of multi. 
It adds the column header, and row header, makes sure the columns are right-justified. 
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Overall integration</h3>
<div class="outline-text-3" id="text-4-4">
<p>
(multi-tab-primes n) 
</p>

<p>
Returns the string suitable to be displayed 
    for the multiplication table of the first n primes. 
    This is the highest level function with side effect. It can be called in main to display the multiplication table. 
</p>
</div>
</div>
