design-test-implementation.org
** Test Driven Development (TDD)

Based on the above design, all functions are developed first with test case(s), which solidify the parameters, and return value, 
and typical case of input, and the expected output. 

Then the function is developed based on the specification, and test cases. 

The design is done to separate concerns of different nature, and properly abstracted, so that each function's specification, and test cases can be defined with 
little coupling with the other functions as much as possible. 

Especially, side effect is only limited to the function -main, so that all other function can be tested by values alone, taking advantage of persistence.

midje plug-in is used to implement automated continuous tests. 

As the example is rather simple, there is not much to demonstrate the emphasis on behavior driven development (BDD). 
The major user behavior is the use case of user requesting multiplication table of first n primes. The use case is supported by the function multi-tab-primes, in turns,
functions are defined and specified to support multi-tab-primes

** Further Improvement and Extension

- Arbitrary number of the first prime numbers. By parsing command line argument, it's possible to support arbitrary number of prime numbers.
- Provide multiplication table through other user interface, such as web. The design is layered, it's possible to change the representation mechanism to support 
    other user interface.
- The command line at the present is not user friendly. The command line is too long. The jar file may be installed in a directory on CLASSPATH 
    so that a user does need to specify the direcotry where the jar file located. 

** Algorithm of finding prime numbers

Iterate from existing seeds of primes, to generate the next prime number. The candidate is the largest prime seed plus 2, 4, ..., (sequence of even numbers). 
The candidacy is confirmed if the candidate cannot be divided by all the prime seeds.
(Actually, it's sufficient to check all the prime seeds, whose square is not greater than the candidate.)

** Performance optimization for function primse, and others

The complexity of generating the first n pri0me numbers may not be linear to the number n. 
It takes o(n) number of remainder operations, to tell if a number is a prime or not, 
but it's hard to tell the complexity to find the next prime number based on the current prime number seeds, 
as one has to explore the even number bigger than the existing prime numbers. 
It may not be a function of n at all. 
It depends on the distribution characteristics of the prime numbers. At the moment, I feel that it's beyond my knowledge and time to investigate 
the complexity of finding one new prime number. I'll just try to be as economical as possible. 

In the future, more might be done in controlling the space for prime candidates in additional to assuming it to be odd numbers larger than the current existing prime numebers. 

In order to reduce computation as much as possible, the following optimization considerations are taken:
- After 2, all prime numbers must be odd number, 
    so the candidates of the next prime number after existing number would be start from the largest prime number plus 2, to keep the candidates odd numbers.

- If a number is divisible by another number, it must be divisible by certain prime numbers. 
Such prime numbers should be smaller than the candidate under investigation.

- Furthermore, it's sufficient to check divisibility with smaller prime number p such that p*p should be less or equal to the candidate under investigation, 
    since, if a number x could be divided by prime number p larger than the square root of x, 
    then there would be another prime number q such that p*q*r = x, where r is another number. 
    In this case, q must be smaller than the square root of x, otherwise, p*q would be larger than x.  

All the rest of the computation or transformation is of lower complexity, o(n*n), where n is the number of prime numbers.

As a*b = b*a, the multiplication can be further reduced by about half by doing memoize the computation. 

The total elapse time of multi-tab-primes for 10 prime numbers is about 33 msecs, when running with 
    
java -jar multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar

However, when running with 

leni run

It takes about 13 msecs. The difference is yet to know. 

By looking at more detailed elapsed time:

#+BEGIN_SRC quote
"Elapsed time: 7.731669 msecs" ; (primes 10)
"Elapsed time: 2.605125 msecs" ; (multi, 
"Elapsed time: 21.287298 msecs" ; (table-str,
#+END_SRC
I'm surprised that it takes more than 21 msecs to do string format with table-str, more than that of (primes 10) to generate the first 10 prime numbers. 
It may change when further prime numbers becomes less dense. 

Overall, it seems the response time is acceptable for current requirements. 

It would be faster to combine multi and table-str to directly produce the string represenation of the multiplication table, save one round of traversing the matrix. 
But I feel that it's more coupled. This may be discussed further.  

* Project meta
** Project definition
#+BEGIN_SRC clojure :tangle project.clj
  (defproject multiplication-table-of-prime "0.1.0-SNAPSHOT"
    :description "This provides multiplication table of prime numbers"
    :url ""
    :license {:name "Eclipse Public License"
              :url "http://www.eclipse.org/legal/epl-v10.html"}
    :dependencies [[org.clojure/clojure "1.6.0"]]
    :main ^:skip-aot multiplication-table-of-prime.core
    :target-path "target/%s"
    :profiles {:uberjar {:aot :all}
               :dev {:dependencies [[midje "1.6.3"]]}})
#+END_SRC

