design-test-implementation.org
** The README
#+BEGIN_SRC markdown :tangle README.md
  # multiplication-table-of-prime

  This programs provides multiplication table of prime numbers.

  ## Installation

  Place the jar file of multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar
  at a directory which is convenient to access for the user.

  ## Usage

  Execute the following at the command line:

      $ java -jar multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar

  Produces a multiplication table of the first 10 prime numbers of 2, 3, 5, 7, 9, ...
  a table of multiplications of the prime numbers will be displayed at STDOUT. 

  Assume that the current directory is where the jar file multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar resides.

  By default, the jar file

  multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar

  is at

      <project-root-directory>/target/uberjar

      <project-root-directory>

  is the place holder for the root directory of the project for multiplication table of prime numbers. 

  ## Produce the jar file for the program

  At the root directory of the Clojure project, execute the following at the command line:

      $ lein uberjar

  ## Literate programming

  This program is developed with "Literate Programming". The design, test specification, and development can be found at [Literate Programming Workbook](./design-test-implementation.org)
  all source code are generated from it, therefore 
  there is little comments in the source code. To review the code, design, etc., it's better read [Literate Programming Presentation](./design-test-implementation.html), which is more readable. 
#+END_SRC

* Source-code

** Preamble

#+BEGIN_SRC clojure :tangle test/multiplication_table_of_prime/core_test.clj
  (ns multiplication-table-of-prime.core-test
    (:require [midje.sweet :refer :all]
              [multiplication-table-of-prime.core :refer :all]
              ))
#+END_SRC

#+NAME: core
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (ns multiplication-table-of-prime.core
  (:gen-class))
#+END_SRC

** primes

#+NAME:primes-test
#+BEGIN_SRC clojure :tangle test/multiplication_table_of_prime/core_test.clj
  (facts "about `primes'"
         (fact "First prime number"
               (primes 1) => [2])
         (fact "More prime numbers"
               (primes 3) => [2 3 5])
         (fact "First 10 prime numbers"
               (primes 10) => [2 3 5 7 11 13 17 19 23 29]))
 #+END_SRC
<<primes-test>>
#+NAME:primes
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (defn primes
    "Produces the first n primes starting from the smallest, 2. It returns a lazy sequence."

    [n]
    (if (= n 1)
      [2]
      (nth 
       (iterate
        (fn [seeds]
          (conj seeds (first
                       (filter (fn [c] (every? (fn [p] (< 0 (mod c p))) (filter (fn [p] (<= (* p p) c)) seeds)))
                               (map (partial + (last seeds))
                                    (filter even? (drop 1 (range)))))))) [2 3])
       (- n 2))))
 #+END_SRC

<<primes>>

** multi

#+NAME:multi-test
#+BEGIN_SRC clojure :tangle test/multiplication_table_of_prime/core_test.clj
  (facts "about `multi'"
         (fact "Some multiplications"
               (multi 3 (range)) => {:matrix [[0 0 0]
                                      [0 1 2]
                                      [0 2 4]]
                                     :max 4
                                     :row-header [0 1 2]
                                     :column-header [0 1 2]}))
 #+END_SRC
<<multi-test>>
#+NAME:multi
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (defn multi
    "Produces the multiplications of the first n numbers in numbers which may be a lazy-sequence, 
    returns a map with key matrix and value of the computed multiplication table, in terms of sequence of sequences, as sequence of rows
    and a key of max, with the maximum value in the matrix. 
    The maximum value may be used to for the width of numbers for properly formatting the multiplication table. 
    It also returns key of column-row, with value for the header for the columns, 
    and row-header, with value for each row in the table."

    [n numbers]
    (let [numbers-realized (take n numbers)
          *_remembered (memoize (fn [x y] (* x y)))
          matrix (for [x numbers-realized]
                   (for [y numbers-realized] (*_remembered x y)))
          max-value (#(*_remembered % %) (last numbers-realized))]
      {:matrix matrix :max max-value
       :row-header numbers-realized :column-header numbers-realized}))
 #+END_SRC

<<multi>>


** table-str
#+NAME:table-str-test
#+BEGIN_SRC clojure :tangle test/multiplication_table_of_prime/core_test.clj
  (facts "about `table-str'"
         (fact "matrix as a table as a string"
               (table-str {:matrix [[0 0 0]
                                        [0 1 2]
                                        [0 200 4]]
                           :max 200
                           :row-header [0 1 2]
                           :column-header [0 1 2]})
               => "       0   1   2\n   0   0   0   0\n   1   0   1   2\n   2   0 200   4")
   )
 #+END_SRC

<<table-str-test>>
#+NAME:table-str
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (defn table-str 
    "generates the formated string to be displayed for the matrix, based on the output of multi. 
    It adds the column header, and row header, makes sure the columns are right-justified. "

    [{:keys [matrix max row-header column-header]}]
    (let [width (count (str max))]
      (let [number-str #(format (str " %" width "d") %)
            row-header-width (count (number-str (first row-header)))]
        (str
         (apply str (concat (repeat row-header-width " ") (map number-str column-header))) "\n"
         (clojure.string/join "\n"
                              (for [i (range (count matrix))]
                                (str (number-str (nth row-header i))
                                     (apply str (for [x (nth matrix i)] (number-str x))))))))))
 #+END_SRC

<<table-str>>

** multi-tab-primes


#+NAME:multi-tab-primes-test
#+BEGIN_SRC clojure :tangle test/multiplication_table_of_prime/core_test.clj
  (facts "about `multi-tab-primes'"
         (fact "multiplication table for the first 3 prime numbers"
               (multi-tab-primes 3) =>
               "     2  3  5\n  2  4  6 10\n  3  6  9 15\n  5 10 15 25")
   )
 #+END_SRC
<<multi-tab-primes-test>>
#+NAME:multi-tab-primes
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (defn multi-tab-primes
    "Returns the string suitable to be displayed 
    for the multiplication table of the first n primes."

    [n]
    (let [prime-nbrs (time (primes n))
          mat (time (multi n prime-nbrs))
          s (time (table-str mat))]
      s
      ;; (->> prime-nbrs
      ;;      (multi n,)
      ;;      table-str)
      )
    )
 #+END_SRC

<<multi-tab-primes>>

