design-test-implementation.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> The README</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">

<pre class="src src-markdown"># multiplication-table-of-prime

This programs provides multiplication table of prime numbers.

## Installation

Place the jar file of multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar
at a directory which is convenient to access for the user.

## Usage

Execute the following at the command line:

    $ java -jar multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar

Produces a multiplication table of the first 10 prime numbers of 2, 3, 5, 7, 9, ...
a table of multiplications of the prime numbers will be displayed at STDOUT. 

Assume that the current directory is where the jar file multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar resides.

By default, the jar file

multiplication-table-of-prime-0.1.0-SNAPSHOT-standalone.jar

is at

    &lt;project-root-directory&gt;/target/uberjar

    &lt;project-root-directory&gt;

is the place holder for the root directory of the project for multiplication table of prime numbers. 

## Produce the jar file for the program

At the root directory of the Clojure project, execute the following at the command line:

    $ lein uberjar

## Literate programming

This program is developed with "Literate Programming", the design, test specification, and development can be found at ./design-test-implementation.org
all source code are generated from it, therefore 
there is little comments in the source code. To review the code, design, etc., it's better read ./design-test-implementation.html, which is more readable.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Source-code</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Preamble</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-clojure">(ns multiplication-table-of-prime.core-test
  (:require [midje.sweet :refer :all]
            [multiplication-table-of-prime.core :refer :all]
            ))
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure" id="core">(ns multiplication-table-of-prime.core
(:gen-class))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> primes</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-clojure">(facts "about `primes'"
       (fact "First prime number"
             (primes 1) =&gt; [2])
       (fact "More prime numbers"
             (primes 3) =&gt; [2 3 5])
       (fact "First 10 prime numbers"
             (primes 10) =&gt; [2 3 5 7 11 13 17 19 23 29]))
</pre>
</div>
<p>
<a id="primes-test" name="primes-test"></a>
</p>
<div class="org-src-container">

<pre class="src src-clojure">(defn primes
  "Produces the first n primes starting from the smallest, 2. It returns a lazy sequence."

  [n]
  (if (= n 1)
    [2]
    (nth 
     (iterate
      (fn [seeds]
        (conj seeds (first
                     (filter (fn [c] (every? (fn [p] (&lt; 0 (mod c p))) (filter (fn [p] (&lt;= (* p p) c)) seeds)))
                             (map (partial + (last seeds))
                                  (filter even? (drop 1 (range)))))))) [2 3])
     (- n 2))))
</pre>
</div>

<p>
<a id="primes" name="primes"></a>
</p>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> multi</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">

<pre class="src src-clojure">(facts "about `multi'"
       (fact "Some multiplications"
             (multi 3 (range)) =&gt; {:matrix [[0 0 0]
                                    [0 1 2]
                                    [0 2 4]]
                                   :max 4
                                   :row-header [0 1 2]
                                   :column-header [0 1 2]}))
</pre>
</div>
<p>
<a id="multi-test" name="multi-test"></a>
</p>
<div class="org-src-container">

<pre class="src src-clojure">(defn multi
  "Produces the multiplications of the first n numbers in numbers which may be a lazy-sequence, 
  returns a map with key matrix and value of the computed multiplication table, in terms of sequence of sequences, as sequence of rows
  and a key of max, with the maximum value in the matrix. 
  The maximum value may be used to for the width of numbers for properly formatting the multiplication table. 
  It also returns key of column-row, with value for the header for the columns, 
  and row-header, with value for each row in the table."

  [n numbers]
  (let [numbers-realized (take n numbers)
        *_remembered (memoize (fn [x y] (* x y)))
        matrix (for [x numbers-realized]
                 (for [y numbers-realized] (*_remembered x y)))
        max-value (#(*_remembered % %) (last numbers-realized))]
    {:matrix matrix :max max-value
     :row-header numbers-realized :column-header numbers-realized}))
</pre>
</div>

<p>
<a id="multi" name="multi"></a>
</p>
</div>
</div>


<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> table-str</h3>
<div class="outline-text-3" id="text-6-4">
<div class="org-src-container">

<pre class="src src-clojure">(facts "about `table-str'"
       (fact "matrix as a table as a string"
             (table-str {:matrix [[0 0 0]
                                      [0 1 2]
                                      [0 200 4]]
                         :max 200
                         :row-header [0 1 2]
                         :column-header [0 1 2]})
             =&gt; "       0   1   2\n   0   0   0   0\n   1   0   1   2\n   2   0 200   4")
 )
</pre>
</div>

<p>
<a id="table-str-test" name="table-str-test"></a>
</p>
<div class="org-src-container">

<pre class="src src-clojure">(defn table-str 
  "generates the formated string to be displayed for the matrix, based on the output of multi. 
  It adds the column header, and row header, makes sure the columns are right-justified. "

  [{:keys [matrix max row-header column-header]}]
  (let [width (count (str max))]
    (let [number-str #(format (str " %" width "d") %)
          row-header-width (count (number-str (first row-header)))]
      (str
       (apply str (concat (repeat row-header-width " ") (map number-str column-header))) "\n"
       (clojure.string/join "\n"
                            (for [i (range (count matrix))]
                              (str (number-str (nth row-header i))
                                   (apply str (for [x (nth matrix i)] (number-str x))))))))))
</pre>
</div>

<p>
<a id="table-str" name="table-str"></a>
</p>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> multi-tab-primes</h3>
<div class="outline-text-3" id="text-6-5">
<div class="org-src-container">

<pre class="src src-clojure">(facts "about `multi-tab-primes'"
       (fact "multiplication table for the first 3 prime numbers"
             (multi-tab-primes 3) =&gt;
             "     2  3  5\n  2  4  6 10\n  3  6  9 15\n  5 10 15 25")
 )
</pre>
</div>
<p>
<a id="multi-tab-primes-test" name="multi-tab-primes-test"></a>
</p>
<div class="org-src-container">

<pre class="src src-clojure">(defn multi-tab-primes
  "Returns the string suitable to be displayed 
  for the multiplication table of the first n primes."

  [n]
  (let [prime-nbrs (time (primes n))
        mat (time (multi n prime-nbrs))
        s (time (table-str mat))]
    s
    ;; (-&gt;&gt; prime-nbrs
    ;;      (multi n,)
    ;;      table-str)
    )
  )
</pre>
</div>

<p>
<a id="multi-tab-primes" name="multi-tab-primes"></a>
</p>
</div>
</div>
