design-test-implementation.org
** main
#+NAME:main
#+BEGIN_SRC clojure :tangle src/multiplication_table_of_prime/core.clj
  (defn -main
    "Calculate and display multiplication table of the first 10 prime numbers."

    [& args]
    ;; Check the response time of generating the multiplication table.
    ;; (println (time (multi-tab-primes 10)))
    (println (multi-tab-primes 10))
    )

#+END_SRC

* Appendix

This file is for literate programming. It's adapted from Kai Wu's "Clojure Default/Project Skeleton, Using Org Literate Programming"

The following excepted from his introduction.

** Meta: this file, Clojure + Org → LP, etc.
You're looking at a literate programming (LP) file, specifically an
[[http://orgmode.org][Org mode]] formatted file combining both documentation (Org's structured
markup) and code blocks (Clojure code).

For best results please *use Emacs 24.3 or later to view this* =.org=
*file*. If you're looking at this on Github.com, STOP - the rendering
there is neither complete nor correct!

*** The *benefits* of LP using Emacs + Org
1. Docs matter, a lot. With LP, documentation is integral to
   development, never an afterthought.
   - For all but small throwaway systems, you're likely keeping a
     separate file of development notes already; LP would integrate
     that.
2. With one LP file, avoid the incidental/inessential complexity of
   the filesystem: avoid context-switch overhead moving between files,
   and sidestep your language's imposed filesystem structure.
3. Org rocks for prose:
   - Org's plain-text *markup is lightweight*, yet more powerful than
     Markdown, and cleaner than rST.
   - The *structural editing* provided by Org documents lets you
     organize your thoughts/writing/code very quickly.  With good
     structure even major revisions are easy.
   - Org's exporter lets your *write-once, express-many-times*: you
     can export an Org file to HTML (e.g. for blogging) or LaTeX
     (for serious publishing).
   - It's easy to version-control Org files.
4. Org rocks for code:
   - Each code block has flexible granularity: can be named and
     referred to; evaluated or not; have data sent in or exported;
     specify different REPL sessions; specify different target/tangled
     files.
   - Code blocks are syntax-highlighted.
   - Code blocks are ready to edit: jump to major-mode editing easily.
   - A single Org file can mix different languages.
5. Meta-development, manage complexity from a coherent perspective: a
   unified, single-file approach encourages holistic software
   development and exposition, in a natural order, using structure to
   enhance understanding.  LP is not just documentation and code
   together: it's a *process and abstraction unifying the development
   lifecycle*: requirements, architecture, design, code, tests,
   deployment, and maintenance - can all be bound coherently in one
   active format.


** Using this file
*** Prerequisites
1. A recent version of Emacs, 24.3+.
2. Both org-mode (included w/ Emacs 24) and =clojure-mode= installed;
   use Emacs ELPA as needed.
   - Consider using an Emacs "starter package" that provides a good
     baseline, like [[http://batsov.com/prelude/][Emacs Prelude]] or [[http://overtone.github.io/emacs-live/][Emacs Live]].

Then if you start Emacs and load this file, you'll see it the way it's
meant to be seen: as a multi-level, hierarchically organized and
structured literate code file, w/ syntax-highlighted code blocks.  

*** Weaving and tangling
To use the original Knuth terminology, this single file can be /woven/
into documentation, or /tangled/ to code.

**** Weave/export, to documentation
+ To /weave/: the Org equivalent of /weaving/ is to export this file,
  typically to HTML or LaTeX/PDF. The keystroke is =C-c-e= i.e. hold
  down the Control key while pressing "c" then "e" to view the export
  options.
  - e.g. export this file to HTML with =CTRL-c-e h= or, to see it
    immediately in a browser window, =CTRL-c-e b=.
+ You don't have to export this file though; if/when you're comfy in
  Emacs, the Org format itself is great.

**** Tangle, to code
+ To /tangle/: in Org, it's the same word/term. =C-c-v-t= will cause
  all designated code blocks in this file to appear in the filesystem.
  Here, the code blocks go to files and directories matching a new
  Clojure app, as would be produced by =lein new app
  the-project-name=.

*** Other coolness
- =SHIFT-TAB= will *cycle* the display: top-level headings only, all
  headings, or fully-expanded.
- Within a code block, =CTRL-c= ='= will open a buffer to edit the
  code. For full power, be sure =clojure-mode=, =paredit=, and
  =nrepl= are installed.
- Org docs: see [[http://orgmode.org/org.html][main documentation]], especially sections on [[http://orgmode.org/org.html#Document-Structure][structure]],
  [[http://orgmode.org/org.html#Hyperlinks][links]], [[http://orgmode.org/org.html#Markup][markup]], and [[http://orgmode.org/org.html#Working-With-Source-Code][literate programming]] features.


