design-test-implementation.html

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> main</h3>
<div class="outline-text-3" id="text-6-6">
<div class="org-src-container">

<pre class="src src-clojure">(defn -main
  "Calculate and display multiplication table of the first 10 prime numbers."

  [&amp; args]
  ;; Check the response time of generating the multiplication table.
  ;; (println (time (multi-tab-primes 10)))
  (println (multi-tab-primes 10))
  )
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Appendix</h2>
<div class="outline-text-2" id="text-7">
<p>
This file is for literate programming. It's adapted from Kai Wu's "Clojure Default/Project Skeleton, Using Org Literate Programming"
</p>

<p>
The following excepted from his introduction.
</p>
</div>

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Meta: this file, Clojure + Org → LP, etc.</h3>
<div class="outline-text-3" id="text-7-1">
<p>
You're looking at a literate programming (LP) file, specifically an
<a href="http://orgmode.org">Org mode</a> formatted file combining both documentation (Org's structured
markup) and code blocks (Clojure code).
</p>

<p>
For best results please <b>use Emacs 24.3 or later to view this</b> <code>.org</code>
<b>file</b>. If you're looking at this on Github.com, STOP - the rendering
there is neither complete nor correct!
</p>
</div>

<div id="outline-container-sec-7-1-1" class="outline-4">
<h4 id="sec-7-1-1"><span class="section-number-4">7.1.1</span> The <b>benefits</b> of LP using Emacs + Org</h4>
<div class="outline-text-4" id="text-7-1-1">
<ol class="org-ol">
<li>Docs matter, a lot. With LP, documentation is integral to
development, never an afterthought.
<ul class="org-ul">
<li>For all but small throwaway systems, you're likely keeping a
separate file of development notes already; LP would integrate
that.
</li>
</ul>
</li>
<li>With one LP file, avoid the incidental/inessential complexity of
the filesystem: avoid context-switch overhead moving between files,
and sidestep your language's imposed filesystem structure.
</li>
<li>Org rocks for prose:
<ul class="org-ul">
<li>Org's plain-text <b>markup is lightweight</b>, yet more powerful than
Markdown, and cleaner than rST.
</li>
<li>The <b>structural editing</b> provided by Org documents lets you
organize your thoughts/writing/code very quickly.  With good
structure even major revisions are easy.
</li>
<li>Org's exporter lets your <b>write-once, express-many-times</b>: you
can export an Org file to HTML (e.g. for blogging) or LaTeX
(for serious publishing).
</li>
<li>It's easy to version-control Org files.
</li>
</ul>
</li>
<li>Org rocks for code:
<ul class="org-ul">
<li>Each code block has flexible granularity: can be named and
referred to; evaluated or not; have data sent in or exported;
specify different REPL sessions; specify different target/tangled
files.
</li>
<li>Code blocks are syntax-highlighted.
</li>
<li>Code blocks are ready to edit: jump to major-mode editing easily.
</li>
<li>A single Org file can mix different languages.
</li>
</ul>
</li>
<li>Meta-development, manage complexity from a coherent perspective: a
unified, single-file approach encourages holistic software
development and exposition, in a natural order, using structure to
enhance understanding.  LP is not just documentation and code
together: it's a <b>process and abstraction unifying the development
lifecycle</b>: requirements, architecture, design, code, tests,
deployment, and maintenance - can all be bound coherently in one
active format.
</li>
</ol>
</div>
</div>
</div>


<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Using this file</h3>
<div class="outline-text-3" id="text-7-2">
</div><div id="outline-container-sec-7-2-1" class="outline-4">
<h4 id="sec-7-2-1"><span class="section-number-4">7.2.1</span> Prerequisites</h4>
<div class="outline-text-4" id="text-7-2-1">
<ol class="org-ol">
<li>A recent version of Emacs, 24.3+.
</li>
<li>Both org-mode (included w/ Emacs 24) and <code>clojure-mode</code> installed;
use Emacs ELPA as needed.
<ul class="org-ul">
<li>Consider using an Emacs "starter package" that provides a good
baseline, like <a href="http://batsov.com/prelude/">Emacs Prelude</a> or <a href="http://overtone.github.io/emacs-live/">Emacs Live</a>.
</li>
</ul>
</li>
</ol>

<p>
Then if you start Emacs and load this file, you'll see it the way it's
meant to be seen: as a multi-level, hierarchically organized and
structured literate code file, w/ syntax-highlighted code blocks.  
</p>
</div>
</div>

<div id="outline-container-sec-7-2-2" class="outline-4">
<h4 id="sec-7-2-2"><span class="section-number-4">7.2.2</span> Weaving and tangling</h4>
<div class="outline-text-4" id="text-7-2-2">
<p>
To use the original Knuth terminology, this single file can be <i>woven</i>
into documentation, or <i>tangled</i> to code.
</p>
</div>

<ol class="org-ol"><li><a id="sec-7-2-2-1" name="sec-7-2-2-1"></a>Weave/export, to documentation<br  /><div class="outline-text-5" id="text-7-2-2-1">
<ul class="org-ul">
<li>To <i>weave</i>: the Org equivalent of <i>weaving</i> is to export this file,
typically to HTML or LaTeX/PDF. The keystroke is <code>C-c-e</code> i.e. hold
down the Control key while pressing "c" then "e" to view the export
options.
<ul class="org-ul">
<li>e.g. export this file to HTML with <code>CTRL-c-e h</code> or, to see it
immediately in a browser window, <code>CTRL-c-e b</code>.
</li>
</ul>
</li>
<li>You don't have to export this file though; if/when you're comfy in
Emacs, the Org format itself is great.
</li>
</ul>
</div>
</li>

<li><a id="sec-7-2-2-2" name="sec-7-2-2-2"></a>Tangle, to code<br  /><div class="outline-text-5" id="text-7-2-2-2">
<ul class="org-ul">
<li>To <i>tangle</i>: in Org, it's the same word/term. <code>C-c-v-t</code> will cause
all designated code blocks in this file to appear in the filesystem.
Here, the code blocks go to files and directories matching a new
Clojure app, as would be produced by <code>lein new app
  the-project-name</code>.
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-7-2-3" class="outline-4">
<h4 id="sec-7-2-3"><span class="section-number-4">7.2.3</span> Other coolness</h4>
<div class="outline-text-4" id="text-7-2-3">
<ul class="org-ul">
<li><code>SHIFT-TAB</code> will <b>cycle</b> the display: top-level headings only, all
headings, or fully-expanded.
</li>
<li>Within a code block, <code>CTRL-c</code> ='= will open a buffer to edit the
code. For full power, be sure <code>clojure-mode</code>, <code>paredit</code>, and
<code>nrepl</code> are installed.
</li>
<li>Org docs: see <a href="http://orgmode.org/org.html">main documentation</a>, especially sections on <a href="http://orgmode.org/org.html#Document-Structure">structure</a>,
<a href="http://orgmode.org/org.html#Hyperlinks">links</a>, <a href="http://orgmode.org/org.html#Markup">markup</a>, and <a href="http://orgmode.org/org.html#Working-With-Source-Code">literate programming</a> features.
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yu Shen</p>
<p class="date">Created: 2015-07-02 Thu 08:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
